# Script Contents
### -Import Libraries

### -Import Data

### -Exploring Data

### -Wrangling Data

### -Quality and Consistency Checks

### -Confirm and Investigate Combined Data

### -Export Combined Data

# Importing Libraries

In [3]:
#Import Libraries
import pandas as pd
import numpy as np
import os

# Importing Data

In [6]:
# Create a path to my main project folder
path = r'C:\Users\jacks\Instacart Basket Analysis 081424'

In [8]:
# Import the new customer data
cust = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

# Exploring Data

In [11]:
# Check out the columns and first few rows of the customer data
cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [13]:
# Check out the las6t few rows
cust.tail()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
206204,168073,Lisa,Case,Female,North Carolina,44,4/1/2020,1,married,148828
206205,49635,Jeremy,Robbins,Male,Hawaii,62,4/1/2020,3,married,168639
206206,135902,Doris,Richmond,Female,Missouri,66,4/1/2020,2,married,53374
206207,81095,Rose,Rollins,Female,California,27,4/1/2020,1,married,99799
206208,80148,Cynthia,Noble,Female,New York,55,4/1/2020,1,married,57095

In [15]:
# Check out the shape
cust.shape

(206209, 10)

In [17]:
# Check out some summary stats of the numeric data
cust.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [24]:
# Checking out data types
cust.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

### So far, nothing stands out as being strange or a potential issue in this dataframe. I'm not sure that user IDs need to be integers since they won't be analyzed for their numeric value

# Wrangling Data

### Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that don’t add anything to your analysis.

In [40]:
# Renaming some columns for more consistency and clarity
cust.rename(columns={'Surnam':'Last Name','STATE':'State','date_joined':'Date Joined','n_dependants':'Dependants','fam_status':'Fam Status','income':'Income'}, inplace=True)

In [42]:
# Checking the rename
cust.head()

,user_id,First Name,Last Name,Gender,State,Age,Date_joined,Dependants,Fam_status,Income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

### At this point, I am not going to drop any columns because I can think of a potential use for all columns included in this dataframe. For example, Instacart may want to know the names of their top purchasing customers, they might be curious about products purchased by specific genders, they might want to know how many dependents the top purchasing customers have, etc.

# Quality and Concistency Checks

### Complete the fundamental data quality and consistency checks you’ve learned throughout this Achievement; for example, check for and address missing values and duplicates, and convert any mixed-type data.

In [44]:
# Check for missing values
cust.isnull().sum()

user_id            0
First Name     11259
Last Name          0
Gender             0
State              0
Age                0
Date_joined        0
Dependants         0
Fam_status         0
Income             0
dtype: int64

In [70]:
# Check out the missing first name values
cust[cust['First Name'].isnull() == True]

,user_id,First Name,Last Name,Gender,State,Age,Date_joined,Dependants,Fam_status,Income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222

### In my opinion, there aren't many good options for handling the missing first names. Imputation isn't an option since we can't estimate someone's first name. It doesn't make sense to drop the rows with missing first names since all other data on the customer is available. I don't think creating a flag for missing first names is worthwhile because, at this point in the analysis, it isn't important to have every customers' first name. I could drop the first name column entirely, which I might do later in the analysis if there is no need for it. For now, I am leaving the missing values alone.

In [75]:
# Checking for mixed data types
for col in cust.columns.tolist():
  weird = (cust[[col]].map(type) != cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (cust[weird]) > 0:
    print (col)

First Name

In [78]:
# It makes sense the First Name has mixed-type data since there are null values. 
# I will change the column to string type data only
cust['First Name'] = cust['First Name'].astype('str')

In [80]:
# Re-checking for mixed data types
for col in cust.columns.tolist():
  weird = (cust[[col]].map(type) != cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (cust[weird]) > 0:
    print (col)

In [82]:
# I'm also going to change the user_id column to string data
# I am fairly sure this will need to be done to use this column as a unique identifier
cust['user_id'] = cust['user_id'].astype('str')

In [84]:
# Check the data types
cust.dtypes

user_id        object
First Name     object
Last Name      object
Gender         object
State          object
Age             int64
Date_joined    object
Dependants      int64
Fam_status     object
Income          int64
dtype: object

In [86]:
# Check for duplicates
cust[cust.duplicated()]

Empty DataFrame
Columns: [user_id, First Name, Last Name, Gender, State, Age, Date_joined, Dependants, Fam_status, Income]
Index: []

In [88]:
# There are no duplicates

# Combining Data

### Combine your customer data with the rest of your prepared Instacart data. (Hint: Make sure the key columns are the same data type!)

In [92]:
# First, I need to impot my latest prepared data
ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_grouped.pkl'))

In [94]:
# Reminder of the prepared data columns
ords_prods_merge.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_price,spending_flag,median_days_since,frequency_flag
0,2539329,1,1,2,8,7.0,196,1,0,Soda,...,Mid-range product,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.0,Regular customer
1,2539329,1,1,2,8,7.0,14084,2,0,Organic Unsweetened Vanilla Almond Milk,...,Mid-range product,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.0,Regular customer
2,2539329,1,1,2,8,7.0,12427,3,0,Original Beef Jerky,...,Low-range product,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.0,Regular customer
3,2539329,1,1,2,8,7.0,26088,4,0,Aged White Cheddar Popcorn,...,Low-range product,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.0,Regular customer
4,2539329,1,1,2,8,7.0,26405,5,0,XL Pick-A-Size Paper Towel Rolls,...,Low-range product,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.0,Regular customer

In [98]:
# Reminder of the prepared data types
ords_prods_merge.dtypes

order_id                     int64
user_id                      int64
order_number                 int64
orders_day_of_week           int64
order_hour_of_day            int64
days_since_prior_order     float64
product_id                   int64
add_to_cart_order            int64
reordered                    int64
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
exists                    category
price_range_loc             object
busiest_day                 object
busiest_days                object
busiest_period_of_day       object
max_order                    int64
loyalty_flag                object
avg_price                  float64
spending_flag               object
median_days_since          float64
frequency_flag              object
dtype: object

In [100]:
# user_id is a shared column between the prepared dataframe and the customer dataframe
# user_id is an interger data type in the prepared dataframe
# I changed the user_id to string data in the customer dataframe
# I will change the user_id to string data in the prepared dataframe
ords_prods_merge['user_id'] = ords_prods_merge['user_id'].astype('str')

In [102]:
# Now, I will merge the two dataframes using the user_id column as a unique identifier
# I will use the default inner join
ords_prods_cust_merge = ords_prods_merge.merge(cust, on = 'user_id', indicator=True)

In [104]:
# Check the '_merge' column value counts
ords_prods_cust_merge['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [112]:
# Reminder of pre-merged prepared data shape
ords_prods_merge.shape

(32404859, 24)

In [114]:
# Check out the newly merged data columns and first few rows
ords_prods_cust_merge.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,First Name,Last Name,Gender,State,Age,Date_joined,Dependants,Fam_status,Income,_merge
0,2539329,1,1,2,8,7.0,196,1,0,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
1,2539329,1,1,2,8,7.0,14084,2,0,Organic Unsweetened Vanilla Almond Milk,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
2,2539329,1,1,2,8,7.0,12427,3,0,Original Beef Jerky,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
3,2539329,1,1,2,8,7.0,26088,4,0,Aged White Cheddar Popcorn,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
4,2539329,1,1,2,8,7.0,26405,5,0,XL Pick-A-Size Paper Towel Rolls,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both

In [116]:
# Check out all of the column names
ords_prods_cust_merge.columns

Index(['order_id', 'user_id', 'order_number', 'orders_day_of_week',
       'order_hour_of_day', 'days_since_prior_order', 'product_id',
       'add_to_cart_order', 'reordered', 'product_name', 'aisle_id',
       'department_id', 'prices', 'exists', 'price_range_loc', 'busiest_day',
       'busiest_days', 'busiest_period_of_day', 'max_order', 'loyalty_flag',
       'avg_price', 'spending_flag', 'median_days_since', 'frequency_flag',
       'First Name', 'Last Name', 'Gender', 'State', 'Age', 'Date_joined',
       'Dependants', 'Fam_status', 'Income', '_merge'],
      dtype='object')

In [122]:
# Drop the '_merge' column since the merge appears to be a success
ords_prods_cust_merge = ords_prods_cust_merge.drop(columns=['_merge'])

In [124]:
# Checking that the drop worked
ords_prods_cust_merge.columns

Index(['order_id', 'user_id', 'order_number', 'orders_day_of_week',
       'order_hour_of_day', 'days_since_prior_order', 'product_id',
       'add_to_cart_order', 'reordered', 'product_name', 'aisle_id',
       'department_id', 'prices', 'exists', 'price_range_loc', 'busiest_day',
       'busiest_days', 'busiest_period_of_day', 'max_order', 'loyalty_flag',
       'avg_price', 'spending_flag', 'median_days_since', 'frequency_flag',
       'First Name', 'Last Name', 'Gender', 'State', 'Age', 'Date_joined',
       'Dependants', 'Fam_status', 'Income'],
      dtype='object')

# Exporting Data

### Export this new dataframe as a pickle file so you can continue to use it in the second part of this task.

In [128]:
# Exporting to my Prepared Data folder
ords_prods_cust_merge.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_customers_merged.pkl'))